app/views/services/show.html.erb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2  ORDER BY `users`.`id` ASC LIMIT 1
---
				<p>
					<%if comment.user.photo.present?%>

SELECT  `experiences`.* FROM `experiences` WHERE `experiences`.`service_id` = 1  ORDER BY `experiences`.`id` DESC LIMIT 1
---
			<%else%>
				<p><strong>Estado: </strong> <%= link_to "Experiencia", @service.experiences.last%> </p>