app/views/offerings/index.html.erb

      <%= link_to offering.user.nickname, user_path(offering.user.id) %>
      <%if !offering.user.photo.blank?%>
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2  ORDER BY `users`.`id` ASC LIMIT 1