app/views/offerings/show.html.erb

    <p><strong>Creado por:</strong>
      <%if @offering.user.nickname.blank?%>
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2  ORDER BY `users`.`id` ASC LIMIT 1