app/views/devise/registrations/edit.html.erb

      <div class="field">
        <%= f.select :institution_id, Institution.all.collect {|ins| [ins.name, ins.id]},{:include_blank => "Institución a la que pertenece (Opcional)"},{ :class => 'form-control'} %>
---
SELECT `institutions`.* FROM `institutions`