app/views/devise/registrations/new.html.erb

SELECT `categories`.* FROM `categories`
---
								<p><%= f.label :category, "Tipo de usuario" %></p>
								<% Category.all.each do |category| %>