app/views/parsials/_navigation.html.erb

			<li id="contadorUsuarios">
				Miembros activos: <%= User.count %>
---
SELECT COUNT(*) FROM `users`