app/views/presentation/index.html.erb

SELECT `users`.* FROM `users` WHERE (created_at >= '2015-07-12 07:48:56.656657')
---
				<%if User.last.photo.present? %>
					<%=link_to image_tag(User.last.photo.url(:mini),:class=>'RoundPicture'),User.last%>