app/views/partials/_intranet.html.erb

SELECT COUNT(*) FROM `users`
---
		<div class="panel-footer">
			<p style="text-align:center;"><b>Miembros activos:</b>  <%= User.count%></p>