app/views/partials/_navigation.html.erb


			<p class="navbar-text navbar-right">Miembros activos: <%= User.count %> </p>
---
SELECT COUNT(*) FROM `users`