app/views/partials/_resources.html.erb

		<div class="panel-body" id="styleSession" >
			<% Resource.order("date DESC").take(4).each do |resource| %>
---
SELECT  `resources`.* FROM `resources`  ORDER BY date DESC LIMIT 4