app/views/events/show.html.erb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1  ORDER BY `users`.`id` ASC LIMIT 1
---
		<%= link_to @event.user.nickname, user_path(@event.user.id) %>
	  	<%if !@event.user.photo.blank?%>