app/views/experiences/_form.html.erb

SELECT `areas`.* FROM `areas`  ORDER BY discipline ASC, name ASC
---
    <div class="panel-body">
     	<%= f.select :area_id, @areas.collect {|area| [area.name, area.id]},{:include_blank => "Area de Trabajo", required: true},{ :class => 'form-control'} %>