app/views/experiences/index.html.erb

SELECT `requests`.* FROM `requests` WHERE (status = 3)
---
					<%= link_to "Ver experiencia", experience%>
					<%if experience.request_id.present?%>