app/controllers/areas_controller.rb

SELECT  `areas`.* FROM `areas` WHERE `areas`.`id` = 24 LIMIT 1
---
    def set_area
      @area = Area.find(params[:id])