app/controllers/bulletins_controller.rb

SELECT  `bulletins`.* FROM `bulletins` LIMIT 5 OFFSET 0
---
	def index
		@bulletins = Bulletin.paginate(page: params[:page],per_page: 5).all

SELECT `sections`.* FROM `sections` WHERE (created_at >= '2015-08-21' AND module = 'Novedad')
SELECT `events`.* FROM `events` WHERE (created_at >= '2015-08-21' AND status = 1)
SELECT `offerings`.* FROM `offerings` WHERE (created_at >= '2015-08-21' AND status = 1)
SELECT `requests`.* FROM `requests` WHERE (created_at >= '2015-08-21' AND status = 1)
SELECT `services`.* FROM `services` WHERE (created_at >= '2015-08-21' AND status = 2)
SELECT `experiences`.* FROM `experiences` WHERE (created_at >= '2015-08-21')
---
	def show
		add_breadcrumb "Boletin "+@bulletin.title, :bulletins_path
		@sections = Section.where(['created_at >= ? AND module = ?',@bulletin.start_date, "Novedad"])
		@events = Event.where(['created_at >= ? AND status = ?',@bulletin.start_date,1])
		@offerings = Offering.where(['created_at >= ? AND status = ?',@bulletin.start_date,1])
		@requests = Request.where(['created_at >= ? AND status = ?',@bulletin.start_date,1])
		@services = Service.where(['created_at >= ? AND status = ?',@bulletin.start_date,2])
		@experiences = Experience.where(['created_at >= ?',@bulletin.start_date])

SELECT `users`.* FROM `users`
INSERT INTO `bulletins` (`title`, `description`, `created_at`, `updated_at`) VALUES ('Probando producción', '<p>este correo le llegar&aacute; a todos :)</p>', '2015-08-25 16:37:34', '2015-08-25 16:37:34')
SELECT `sections`.* FROM `sections` WHERE (created_at >= '2015-08-21' AND module = 'Novedad')
SELECT `events`.* FROM `events` WHERE (created_at >= '2015-08-21' AND status = 1)
SELECT `offerings`.* FROM `offerings` WHERE (created_at >= '2015-08-21' AND status = 1)
SELECT `requests`.* FROM `requests` WHERE (created_at >= '2015-08-21' AND status = 1)
---
	def create
		@bulletin = Bulletin.new(bulletin_params)
		@user = User.all
		respond_to do |format|
			if @bulletin.save
				if @bulletin.start_date > @bulletin.created_at
					@bulletin.update(start_date: Time.now)
					flash[:alert] = "La fecha no puede ser mayor a la de hoy, por lo que se asignó la actual automáticamente"
				end
				@sections = Section.where(['created_at >= ? AND module = ?',@bulletin.start_date, "Novedad"])
				@events = Event.where(['created_at >= ? AND status = ?',@bulletin.start_date,1])
				@offerings = Offering.where(['created_at >= ? AND status = ?',@bulletin.start_date,1])
				@requests = Request.where(['created_at >= ? AND status = ?',@bulletin.start_date,1])

SELECT  `bulletins`.* FROM `bulletins` WHERE `bulletins`.`id` = 1 LIMIT 1
---
		def set_bulletin
			@bulletin = Bulletin.find(params[:id])