app/controllers/comments_controller.rb

INSERT INTO `comments` (`body`, `post_id`, `post_type`, `created_at`, `updated_at`) VALUES ('<p>sadsadsadsadas</p>', 1, 'Service', '2015-08-27 15:58:48', '2015-08-27 15:58:48')
UPDATE `comments` SET `user_id` = 2, `updated_at` = '2015-08-27 15:58:48' WHERE `comments`.`id` = 1
---
	def create
		@post = post
		@comment = @post.comments.create(comment_params)
		@comment.user = current_user
		respond_to do |format|
			if @comment.save