app/controllers/contacts_controller.rb

  def create
    @contact = Contact.new(contact_params)

    respond_to do |format|
      if @contact.save
---
INSERT INTO `contacts` (`name`, `email`, `body`, `created_at`, `updated_at`) VALUES ('Maxitido', 'maximiliano.perez@usach.cl', 'este es un comentario desde producción', '2015-07-17 22:13:47', '2015-07-17 22:13:47')

    def set_contact
      @contact = Contact.find(params[:id])
---
SELECT  `contacts`.* FROM `contacts` WHERE `contacts`.`id` = 1 LIMIT 1