app/controllers/events_controller.rb

SELECT `events`.* FROM `events`  ORDER BY end_time DESC
---
  def index
    @events = Event.all

INSERT INTO `events` (`title`, `description`, `address`, `start_time`, `end_time`, `user_id`, `created_at`, `updated_at`) VALUES ('Evento de prueba', '<p>en cualquier parte dsera esta cosa de ejempllo</p>', 'lugar cualquiera', '2015-08-25 18:16:00', '2015-08-25 18:16:00', 1, '2015-08-25 18:16:47', '2015-08-25 18:16:47')
---
  def create
    @event = Event.new(event_params)
    @event.user_id = current_user.id

    respond_to do |format|
      if @event.save

UPDATE `events` SET `title` = 'Reuniónn en la USACH', `description` = 'Próxima reunión bimensual de la red se realizará en la casa de estudios USACH, a cargo de la secretaría RSU de la misma. Por favor confirmar sus asistencias.', `address` = 'USACH. Libertador Bernardo O\'Higging 1889, entrada por el frontis de la universidad por el metro Estación Central.', `updated_at` = '2015-06-26 20:39:52' WHERE `events`.`id` = 1
---
  def update
    respond_to do |format|
      if @event.update(event_params)