app/controllers/experiences_controller.rb

	def index
		@experiences =Experience.paginate(page: params[:page],per_page: 5).all.order("created_at DESC")
---
SELECT  `experiences`.* FROM `experiences`  ORDER BY created_at DESC LIMIT 5 OFFSET 0