app/controllers/experiences_controller.rb

	def index
		@experiences =Experience.all
		@activos = Service.where(status: 2).order("updated_at DESC")
---
SELECT `experiences`.* FROM `experiences`
SELECT `services`.* FROM `services` WHERE `services`.`status` = 2  ORDER BY updated_at DESC

	def show
		@experience = Experience.find(params[:id])
---
SELECT  `experiences`.* FROM `experiences` WHERE `experiences`.`id` = 1 LIMIT 1

	def create
		@service = servicio
		@experience = @service.experiences.new(experience_params)
		@experience.professor = current_user
		@experience.professor_name = current_user.name
		@experience.professor_email = current_user.email
		if @service.publication_type == "Offering"
			@experience.partner = @service.creator
		else
			@experience.partner = @service.acceptor
		end
		respond_to do |format|
			if @experience.save
---
INSERT INTO `experiences` (`area_id`, `description`, `institution_id`, `faculty`, `department`, `course_name`, `course_type`, `course_type_other`, `period`, `professor_phone`, `professor_degree`, `learning_objectives`, `service_objectives`, `institutional_support`, `frequency`, `weekly_hours`, `participants`, `students_level`, `organization_type`, `benefit`, `results`, `tools`, `reflection_moments`, `title`, `service_id`, `professor_id`, `professor_name`, `professor_email`, `partner_id`, `created_at`, `updated_at`) VALUES (65, 'Oferta ejemplo 1Oferta ejemplo 1', 16, 'Oferta ejemplo 1', 'Oferta ejemplo 1', 'Oferta ejemplo 1', 'Otro', 'Oferta ejemplo 1', 2, 'Oferta ejemplo 1', 3, 'Oferta ejemplo 1', 'Oferta ejemplo 1 Oferta ejemplo 1', 1, 'Oferta ejemplo 1', '12', 1212, 'Oferta ejemplo 1', 'Oferta ejemplo 1', 'Oferta ejemplo 1', 'Oferta ejemplo 1Oferta ejemplo 1Oferta ejemplo 1Oferta ejemplo 1', 'Oferta ejemplo 1Oferta ejemplo 1Oferta ejemplo 1Oferta ejemplo 1Oferta ejemplo 1Oferta ejemplo 1', 'Oferta ejemplo 1Oferta ejemplo 1Oferta ejemplo 1Oferta ejemplo 1Oferta ejemplo 1Oferta ejemplo 1', 'Experiencia de Oferta ejemplo 1', 1, 2, 'Profesor Prueba', 'profesor@rease.cl', 4, '2015-08-27 15:59:32', '2015-08-27 15:59:32')

	def set_realizado
		@offerings = Offering.where("status = ?", 3)
		@requests = Request.where("status = ?", 3)
---
SELECT `offerings`.* FROM `offerings` WHERE (status = 3)
SELECT `requests`.* FROM `requests` WHERE (status = 3)

    def set_institutionsAndAreas
    	@institutions = Institution.all
    	@areas = Area.order("discipline ASC").order("name ASC").all
---
SELECT `institutions`.* FROM `institutions`  ORDER BY name ASC
SELECT `areas`.* FROM `areas`  ORDER BY discipline ASC, name ASC