app/controllers/institutions_controller.rb

  def index
    @institutions = Institution.all
---
SELECT `institutions`.* FROM `institutions`

  def create
    @institution = Institution.new(institution_params)

    respond_to do |format|
      if @institution.save
---
INSERT INTO `institutions` (`name`, `web`, `logo_file_name`, `logo_content_type`, `logo_file_size`, `logo_updated_at`, `created_at`, `updated_at`) VALUES ('googel', 'http://www.google.cl', '2015-01-29_13.29.28.jpg', 'image/jpeg', 3399715, '2015-06-27 00:52:29', '2015-06-27 00:52:30', '2015-06-27 00:52:30')

  def destroy
    @institution.destroy
---
DELETE FROM `institutions` WHERE `institutions`.`id` = 1

    def set_institution
      @institution = Institution.find(params[:id])
---
SELECT  `institutions`.* FROM `institutions` WHERE `institutions`.`id` = 5 LIMIT 1