app/controllers/offerings_controller.rb

	def index
		@disponible = Offering.where(status: 1).paginate(page: params[:page],per_page: 5).order("created_at DESC")
---
SELECT `offerings`.* FROM `offerings` WHERE (title LIKE '%ejemplo%' or description LIKE '%ejemplo%' or status LIKE '%ejemplo%')  ORDER BY created_at DESC

	def create
		@offering = current_user.offerings.new(offering_params)
		@offering.status = 1
		respond_to do |format|
		if @offering.save
---
INSERT INTO `offerings` (`title`, `description`, `resume`, `location`, `start_time`, `end_time`, `user_id`, `created_at`, `updated_at`) VALUES ('Oferta ejemplo 1', '<p>Oferta ejemplo 1&nbsp;Oferta ejemplo 1</p>', 'Oferta ejemplo 1', 'Oferta ejemplo 1', '2015-08-27', '2015-08-27', 2, '2015-08-27 15:54:54', '2015-08-27 15:54:54')

		def set_offering
			@offering = Offering.find(params[:id])
---
SELECT  `offerings`.* FROM `offerings` WHERE `offerings`.`id` = 1 LIMIT 1

		def set_area
			@areas = Area.order("discipline ASC").order("name ASC").all
---
SELECT `areas`.* FROM `areas`  ORDER BY discipline ASC, name ASC