app/controllers/offerings_controller.rb

  def index
    @disponible = Offering.where(status: 1).order("created_at DESC")
    @proceso = Offering.where(status: 2).order("created_at DESC")
    @cancelada = Offering.where(status: 4).order("created_at DESC")
    @caducada = Offering.where(status: 5).order("created_at DESC")
        if params[:search]
      @offerings = Offering.search(params[:search]).order("created_at DESC")
---
SELECT `offerings`.* FROM `offerings`  ORDER BY created_at DESC