app/controllers/presentation_controller.rb

	def index
		@sections = Section.paginate(page: params[:page],per_page: 5).order("priority ASC").where("module = ?","Novedad")
		if user_signed_in?
			@users = User.where("created_at >= ?", 2.week.ago.utc)
			@acta = Resource.where(category: 1).last
---
SELECT  `sections`.* FROM `sections` WHERE (module = 'Novedad')  ORDER BY priority ASC LIMIT 5 OFFSET 0
SELECT `users`.* FROM `users` WHERE (created_at >= '2015-07-12 07:48:56.656657')
SELECT  `resources`.* FROM `resources` WHERE `resources`.`category` = 1  ORDER BY `resources`.`id` DESC LIMIT 1

	def somos
		add_breadcrumb "¿Quiénes Somos?", :presentation_somos_path
		@instituciones = Institution.order("name ASC").all
		@sections = Section.order("priority ASC").where("module = ?","Somos")
---
SELECT `institutions`.* FROM `institutions`  ORDER BY name ASC
SELECT `sections`.* FROM `sections` WHERE (module = 'Somos')  ORDER BY priority ASC

	def hacemos
		add_breadcrumb "¿Qué hacemos?", :presentation_hacemos_path
		@resources = Resource.paginate(page: params[:page],per_page: 10).where(category: 1).order("date DESC")
		@sections = Section.order("priority ASC").where("module = ?","Hacemos")
---
SELECT  `resources`.* FROM `resources` WHERE `resources`.`category` = 1  ORDER BY date DESC LIMIT 10 OFFSET 0
SELECT `sections`.* FROM `sections` WHERE (module = 'Hacemos')  ORDER BY priority ASC

	def aprendizaje
		add_breadcrumb "¿Qué es AS?", :presentation_aprendizaje_path
		@sections = Section.order("priority ASC").where("module = ?","Aprendizaje Servicio")
---
SELECT `sections`.* FROM `sections` WHERE (module = 'Aprendizaje Servicio')  ORDER BY priority ASC

	def estatuto
		add_breadcrumb "Estatuto", :presentation_estatuto_path
		@events = Event.all
    	@interest_links = InterestLink.order("name ASC").all
		@sections = Section.where("module = ?","Estatuto")
---
SELECT `interest_links`.* FROM `interest_links`  ORDER BY name ASC
SELECT `sections`.* FROM `sections` WHERE (module = 'Estatuto')

	def searchPage
		add_breadcrumb "Búsqueda"
		if user_signed_in? ##SEARCH PARA LA INTRANET
			@users = User.order("nickname ASC")
			@sections = Section.where("module = ? or module = ?", "Estatuto", "Novedad")
			@resources = Resource.order("created_at DESC").all
			@institutions = Institution.order("name DESC").all
			@interest_links = InterestLink.order("created_at DESC").all
			@requests = Request.order("title ASC").all
			@offerings = Offering.order("title ASC").all
			@services = Service.where("status = 2 or status = 4 or status = 5").order("updated_at DESC")
			@experiences = Experience.order("created_at DESC").all
---
SELECT `users`.* FROM `users` WHERE (nickname LIKE '%%' or name LIKE '%%' or last_name LIKE '%%' or email LIKE '%%')  ORDER BY created_at DESC
SELECT `sections`.* FROM `sections` WHERE (title LIKE '% %' or body LIKE '% %' or module LIKE '% %') AND (module = 'Estatuto' or module = 'Novedad')
SELECT `resources`.* FROM `resources` WHERE (name LIKE '% %' or category LIKE '% %' or description LIKE '% %')  ORDER BY created_at DESC
SELECT `institutions`.* FROM `institutions` WHERE (name LIKE '%%' or web LIKE '%%')  ORDER BY created_at DESC
SELECT `interest_links`.* FROM `interest_links` WHERE (name LIKE '%%' or description LIKE '%%')  ORDER BY created_at DESC
SELECT `requests`.* FROM `requests` WHERE (title LIKE '% %' or description LIKE '% %' or resume LIKE '% %')  ORDER BY title ASC
SELECT `offerings`.* FROM `offerings` WHERE (title LIKE '% %' or description LIKE '% %' or resume LIKE '% %')  ORDER BY title ASC
SELECT `services`.* FROM `services` WHERE (title LIKE '% %' or message LIKE '% %' or description LIKE '% %' or resume LIKE '% %' ) AND (status = 2 or status = 4 or status = 5)  ORDER BY updated_at DESC
SELECT `experiences`.* FROM `experiences` WHERE (faculty LIKE '% %' or department LIKE '% %' or course_name LIKE '% %' or course_type LIKE '% %' or period LIKE '% %' or learning_objectives LIKE '% %' or service_objectives LIKE '% %' or benefit LIKE '% %' or results LIKE '% %' or tools LIKE '% %' or description LIKE '% %' or reflection_moments LIKE '% %' or title LIKE '% %')  ORDER BY created_at DESC

	def set_presentation
		@events = Event.all
		@interest_links = InterestLink.order("name ASC").all
---
SELECT `events`.* FROM `events` WHERE (title LIKE '%%' or description LIKE '%%')  ORDER BY created_at DESC
SELECT `interest_links`.* FROM `interest_links`  ORDER BY name ASC