app/controllers/presentation_controller.rb

	def index
		@sections = Section.all
---
SELECT `sections`.* FROM `sections`  ORDER BY created_at DESC

	def somos
		add_breadcrumb "¿Quiénes Somos?", :presentation_somos_path
		@sections = Section.all
		@instituciones = Institution.all
---
SELECT `sections`.* FROM `sections`  ORDER BY created_at DESC
SELECT `institutions`.* FROM `institutions`

	def hacemos
		add_breadcrumb "¿Qué hacemos?", :presentation_hacemos_path
		@sections = Section.all
---
SELECT `sections`.* FROM `sections`

	def aprendizaje
		add_breadcrumb "¿Qué es A+S?", :presentation_aprendizaje_path
		@sections = Section.all
---
SELECT `sections`.* FROM `sections`

	def estatutos
		add_breadcrumb "Estatutos", :presentation_estatutos_path
		@sections = Section.all
---
SELECT `sections`.* FROM `sections` WHERE (module = 'Estatutos')