app/controllers/requests_controller.rb

	def index
		@disponible = Request.where(status: 1).paginate(page: params[:page],per_page: 5).order("created_at DESC")
		@cancelada = Request.where(status: 2).order("created_at DESC")
		@caducada = Request.where(status: 3).order("created_at DESC")
		if params[:search]
			@offerings = Request.search(params[:search]).order("created_at DESC")
---
SELECT  `requests`.* FROM `requests` WHERE `requests`.`status` = 1  ORDER BY created_at DESC LIMIT 5 OFFSET 0
SELECT `requests`.* FROM `requests`  ORDER BY created_at DESC

	def create
		@request = current_user.requests.new(defined_params)
		@request.status = 1
		if @request.save
---
INSERT INTO `requests` (`title`, `description`, `user_id`, `created_at`, `updated_at`) VALUES ('sadsad', 'asdsadadsadasdadsadsadsasad', 1, '2015-06-27 06:11:49', '2015-06-27 06:11:49')