app/controllers/requests_controller.rb

  def index
    @requests = Request.all
---
SELECT `requests`.* FROM `requests`