app/controllers/resources_controller.rb

SELECT `interest_links`.* FROM `interest_links`  ORDER BY created_at DESC
---
  def muestra
      add_breadcrumb "Recursos", :resources_muestra_path
      @interest_links = InterestLink.order("created_at DESC").all

SELECT  `resources`.* FROM `resources` WHERE `resources`.`id` = 19 LIMIT 1
---
    def set_resource
      @resource = Resource.find(params[:id])

SELECT `resources`.* FROM `resources` WHERE `resources`.`category` = 2  ORDER BY created_at DESC
---
    def set_categorizated
      @actas = Resource.where(category: 1)