app/controllers/sections_controller.rb

	def index
		@sections = Section.all
---
SELECT `sections`.* FROM `sections`

	def novedades
		add_breadcrumb "Novedades", :sections_novedades_path
		@sections = Section.all
---
SELECT `sections`.* FROM `sections`

	def somos
		add_breadcrumb "¿Quienes Somos?", :sections_somos_path
		@sections = Section.all
---
SELECT `sections`.* FROM `sections`

	def hacemos
		add_breadcrumb "¿Qué hacemos?", :sections_hacemos_path
		@sections = Section.all
---
SELECT `sections`.* FROM `sections`

	def estatutos
		add_breadcrumb "Estatutos", :sections_estatutos_path
		@sections = Section.all
---
SELECT `sections`.* FROM `sections`

	def aprendizaje
		add_breadcrumb "Aprendizaje y Servicio", :sections_aprendizaje_path
		@sections = Section.all
---
SELECT `sections`.* FROM `sections`

	def create
		@section = Section.new(section_params)
		if @section.save
---
INSERT INTO `sections` (`title`, `body`, `order`, `priority`, `created_at`, `updated_at`) VALUES ('sadasdadas', '<p>sadasdasdasdasdasdasdsadasdadsad</p>', 'Aprendizaje y Servicio', 'Alta', '2015-06-27 01:12:58', '2015-06-27 01:12:58')

	def destroy
		@section = Section.find(params[:id])
		@section.destroy
---
SELECT  `sections`.* FROM `sections` WHERE `sections`.`id` = 3 LIMIT 1
DELETE FROM `sections` WHERE `sections`.`id` = 3

	def edit
		add_breadcrumb "Editar sección", :edit_section_path
		flash[:notice] = "La sección ha sido actualizada correctamente"
		@section = Section.find(params[:id])
---
SELECT  `sections`.* FROM `sections` WHERE `sections`.`id` = 1 LIMIT 1

	def update
		@section = Section.find(params[:id])
		if @section.update(section_params)
---
SELECT  `sections`.* FROM `sections` WHERE `sections`.`id` = 1 LIMIT 1
UPDATE `sections` SET `body` = '<ol><li>Instalar el enfoque metodol&oacute;gico de &ldquo;Aprendizaje Servicio&rdquo; en distintas instituciones de educaci&oacute;n, tales como colegios, institutos profesionales, universidades, etc.</li><li>Impulsar la investigaci&oacute;n de la propuesta metodol&oacute;gica de &ldquo;Aprendizaje Servicio&rdquo;.</li><li>Difundir y comunicar en Chile el enfoque metodol&oacute;gico de &ldquo;Aprendizaje Servicio&rdquo;.</li><li>Fomentar y patrocinar la sistematizaci&oacute;n de las distintas experiencias sobre &ldquo;Aprendizaje Servicio&rdquo;.</li><li>Fortalecer la red y articulaci&oacute;n con redes afines.</li></ol>', `updated_at` = '2015-06-27 05:26:03' WHERE `sections`.`id` = 6