app/controllers/services_controller.rb

	def index_activos
		@activos = Service.paginate(page: params[:page],per_page: 5).where(status: 4).order("updated_at DESC")
---
SELECT  `services`.* FROM `services` WHERE `services`.`status` = 4  ORDER BY updated_at DESC LIMIT 5 OFFSET 0

	def show
		@comment = Comment.new
		@service = Service.find(params[:id])
		@experience = @service.experiences.last
---
SELECT  `services`.* FROM `services` WHERE `services`.`id` = 1 LIMIT 1
SELECT  `experiences`.* FROM `experiences` WHERE `experiences`.`service_id` = 1  ORDER BY `experiences`.`id` DESC LIMIT 1

	def create
		@publication = publication
		@service = @publication.services.new(service_params)
		@service.creator = current_user
		@service.title = @publication.title
		@service.area = @publication.area
		@service.description = @publication.description
		@service.resume = @publication.resume
		@service.start_time = @publication.start_time
		@service.end_time = @publication.end_time
		@service.status = 1 #el servicio es solo una petición pendiente.

		respond_to do |format|
			if @service.save
---
INSERT INTO `services` (`message`, `publication_id`, `publication_type`, `creator_id`, `title`, `description`, `resume`, `start_time`, `end_time`, `status`, `created_at`, `updated_at`) VALUES ('Oferta ejemplo 1', 1, 'Offering', 4, 'Oferta ejemplo 1', '<p>Oferta ejemplo 1&nbsp;Oferta ejemplo 1</p>', 'Oferta ejemplo 1', '2015-08-27', '2015-08-27', 1, '2015-08-27 15:55:10', '2015-08-27 15:55:10')

	def update
		@publication = publication
		@service = @publication.services.find(params[:id])
			respond_to do |format|
			if @service.update(service_params)
---
SELECT  `services`.* FROM `services` WHERE `services`.`id` = 1 LIMIT 1
UPDATE `services` SET `acceptor_id` = 2, `institution_id` = 17, `area_id` = 65, `status` = 2, `objectives` = 'Oferta ejemplo 1 Oferta ejemplo 1', `updated_at` = '2015-08-27 15:58:01' WHERE `services`.`id` = 1

		def set_status
			@publication = publication
			@services = publication.services.all
			@pendientes = @services.where(status: 1).order("updated_at DESC")
---
SELECT `services`.* FROM `services` WHERE `services`.`status` = 2  ORDER BY updated_at DESC