app/controllers/users_controller.rb

SELECT `users`.* FROM `users`  ORDER BY nickname ASC
---
	def listarUsuarios
		add_breadcrumb "Usuarios registrados"
		@user = User.order("nickname ASC").all